ruuvi/ruuvi.drivers.c/src/nrf5_sdk15_platform/communication/ruuvi_nrf5_sdk15_communication_ble_advertising.c
/**
 * Ruuvi BLE data advertising.
 *
 * License: BSD-3
 * Author: Otso Jousimaa <otso@ojousima.net>
 */

#include "ruuvi_driver_enabled_modules.h"
#include "ruuvi_interface_communication_ble_advertising.h"
#if RUUVI_NRF5_SDK15_ADV_ENABLED

#include "ruuvi_driver_error.h"
#include "ruuvi_nrf5_sdk15_error.h"
#include "ruuvi_nrf5_sdk15_communication_radio.h"
#include "ruuvi_interface_communication.h"
#include "ruuvi_interface_communication_radio.h"
#include "ruuvi_interface_log.h"
#include "nordic_common.h"
#include "nrf_ble_scan.h"
#include "nrf_nvic.h"
#include "nrf_queue.h"
#include "nrf_soc.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "ble_advdata.h"
#include "ble_types.h"
#include "sdk_errors.h"
#include "nrf_log.h"

#include <stdint.h>

#ifndef RUUVI_NRF5_SDK15_ADV_LOG_LEVEL
#define LOG_LEVEL RI_LOG_LEVEL_INFO
#else
#define LOG_LEVEL RUUVI_NRF5_SDK15_ADV_LOG_LEVEL
#endif
static inline void LOG (const char * const msg)
{
    ri_log (LOG_LEVEL, msg);
}

static inline void LOGD (const char * const msg)
{
    ri_log (RI_LOG_LEVEL_DEBUG, msg);
}

static inline void LOGI (const char * const msg)
{
    ri_log (RI_LOG_LEVEL_INFO, msg);
}

static inline void LOGW (const char * const msg)
{
    ri_log (RI_LOG_LEVEL_WARNING, msg);
}

static inline void LOGE (const char * const msg)
{
    ri_log (RI_LOG_LEVEL_ERROR, msg);
}

#define DEFAULT_ADV_INTERVAL_MS (1010U)
#define MIN_ADV_INTERVAL_MS     (100U)
#define MAX_ADV_INTERVAL_MS     (10000U)
#define NONEXTENDED_ADV_MAX_LEN (24U)

#define APP_BLE_OBSERVER_PRIO   3U //!< Used in concat macro which fails on braces.
NRF_BLE_SCAN_DEF (m_scan);

typedef struct
{
    uint8_t adv_data[RUUVI_NRF5_SDK15_ADV_LENGTH];  //!< Buffer for advertisement
    uint8_t scan_data[RUUVI_NRF5_SDK15_SCAN_LENGTH]; //!< Buffer for scan response.
    ble_gap_adv_data_t   data;   //!< Encoded data, both advertisement and scan response.
    ble_gap_adv_params_t params; //!< Parameters of advertisement, such as channels, PHY.
    int8_t tx_pwr;               //!< Transmission power for this advertisement.
} advertisement_t;               //!< Advertisement to be sent.

/** Create queue for outgoing advertisements. */
NRF_QUEUE_DEF (advertisement_t, m_adv_queue, RUUVI_NRF5_SDK15_ADV_QUEUE_LENGTH,
               NRF_QUEUE_MODE_NO_OVERFLOW);
/** Create queue for incoming advertisements. */
NRF_QUEUE_DEF (ri_comm_message_t, m_scan_queue, RUUVI_NRF5_SDK15_SCAN_QUEUE_LENGTH,
               NRF_QUEUE_MODE_NO_OVERFLOW);

static uint16_t
m_advertisement_interval_ms; //!< Interval of advertisements, not including random delay by BLE spec.
static uint16_t m_manufacturer_id;           //!< Manufacturer ID for advertisements.
static ri_comm_channel_t *
m_channel;        //!< Communication channel interface instance.
static int8_t m_tx_power;                    //!< Power configured to radio.
static bool m_scannable;                     //!< Should scan responses be included.
static ble_gap_conn_sec_mode_t m_security;   //!< BLE security mode.
/** @brief Human-readable device name, e.g. "Ruuvi ABCD". */
static char m_name[NONEXTENDED_ADV_MAX_LEN];
/** @brief Advertise UUID of Nordic UART Service in scan response. */
static bool m_advertise_nus;
static ri_adv_type_t m_type;                 //!< Type, configured by user.
static ri_radio_channels_t m_radio_channels; //!< Enabled channels to send
static bool m_is_ext_adv_enabled;            //!< Extended advertisement enabled.

/** @brief Advertising handle used to identify an advertising set. */
static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
/** @brief Flag for initialization **/
static bool m_advertisement_is_init = false;
/** @brief Flag for advertising in process **/
static bool m_advertising = false;
/** @brief flag for including Ruuvi Sensor data service UUID in the advertisement **/
static bool m_include_service_uuid = false;
/** @brief 16-bit Bluetooth Service UUID to advertise, Ruuvi's UUID by default. */
static uint16_t m_service_uuid = 0xFC98;

/**< Universally unique service identifier of Nordic UART Service */
#if RUUVI_NRF5_SDK15_GATT_ENABLED
#include "ble_nus.h"
static ble_uuid_t m_adv_uuids[] =
{
    {BLE_UUID_NUS_SERVICE, BLE_UUID_TYPE_VENDOR_BEGIN}
};
#endif

static rd_status_t prepare_tx()
{
    ret_code_t nrf_code = NRF_SUCCESS;

    // XXX: Use atomic compare-and-swap
    if (!nrf_queue_is_empty (&m_adv_queue) && !m_advertising)
    {
        static advertisement_t adv;
        nrf_queue_pop (&m_adv_queue, &adv);
        // Pointers have been invalidated in queuing, refresh.
        adv.data.adv_data.p_data = adv.adv_data;

        if (adv.data.scan_rsp_data.len > 0)
        {
            adv.data.scan_rsp_data.p_data = adv.scan_data;
        }

        nrf_code |= sd_ble_gap_adv_set_configure (&m_adv_handle,
                    &adv.data,
                    &adv.params);
        nrf_code |= sd_ble_gap_tx_power_set (BLE_GAP_TX_POWER_ROLE_ADV,
                                             m_adv_handle,
                                             adv.tx_pwr);
        nrf_code |= sd_ble_gap_adv_start (m_adv_handle,
                                          RUUVI_NRF5_SDK15_BLE4_STACK_CONN_TAG);

        if (NRF_SUCCESS == nrf_code)
        {
            m_advertising = true;
        }
        else
        {
            // Recursion depth is limited to depth of m_adv_queue.
            prepare_tx();
        }
    }

    return ruuvi_nrf5_sdk15_to_ruuvi_error (nrf_code);
}

/** @brief terminate advertising set, notify application */
static void notify_adv_stop (const ri_comm_evt_t evt)
{
    m_advertising = false; // Runs at highest app interrupt level, no need for atomic.

    if ( (NULL != m_channel)  && (NULL != m_channel->on_evt))
    {
        m_channel->on_evt (evt, NULL, 0);
    }
}

// Register a handler for advertisement events.
static void ble_advertising_on_ble_evt_isr (ble_evt_t const * p_ble_evt, void * p_context)
{
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            nrf_queue_reset (&m_adv_queue);

