ruuvi/ruuvi.drivers.c/src/nrf5_sdk15_platform/communication/ruuvi_nrf5_sdk15_communication_ble_advertising.c
            if (CONNECTABLE_SCANNABLE == m_type)
            {
                m_type = NONCONNECTABLE_SCANNABLE;
            }

            if (CONNECTABLE_NONSCANNABLE == m_type)
            {
                m_type = NONCONNECTABLE_NONSCANNABLE;
            }

            notify_adv_stop (RI_COMM_ABORTED);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            nrf_queue_reset (&m_adv_queue);
            notify_adv_stop (RI_COMM_ABORTED);
            break;

        // Upon terminated advertising (time-out), start next and notify application TX complete.
        case BLE_GAP_EVT_ADV_SET_TERMINATED:
            notify_adv_stop (RI_COMM_SENT);
            prepare_tx();
            break;

        default:
            break;
    }
}

NRF_SDH_BLE_OBSERVER (m_ble_observer, APP_BLE_OBSERVER_PRIO,
                      ble_advertising_on_ble_evt_isr, NULL);

// Register a handler for scan events.
static void on_advertisement (scan_evt_t const * p_scan_evt)
{
    switch (p_scan_evt->scan_evt_id)
    {
        case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
            LOGI ("Scan timeout\r\n");
            m_channel->on_evt (RI_COMM_TIMEOUT,
                               NULL, 0);
            break;

        // Data which matches the configured filter - todo
        case NRF_BLE_SCAN_EVT_FILTER_MATCH:
            LOGD ("Matching data\r\n");
            // p_scan_evt->params.filter_match.p_adv_report; // Data should be here
            break;

        // All the data, pass to application
        case NRF_BLE_SCAN_EVT_NOT_FOUND:
            LOGD ("Unknown data\r\n");

            if ( (NULL != m_channel)  && (NULL != m_channel->on_evt))
            {
                // Send advertisement report
                ri_adv_scan_t scan;
                scan.addr[0] = p_scan_evt->params.p_not_found->peer_addr.addr[5];
                scan.addr[1] = p_scan_evt->params.p_not_found->peer_addr.addr[4];
                scan.addr[2] = p_scan_evt->params.p_not_found->peer_addr.addr[3];
                scan.addr[3] = p_scan_evt->params.p_not_found->peer_addr.addr[2];
                scan.addr[4] = p_scan_evt->params.p_not_found->peer_addr.addr[1];
                scan.addr[5] = p_scan_evt->params.p_not_found->peer_addr.addr[0];
                scan.rssi    = p_scan_evt->params.p_not_found->rssi;
                memcpy (scan.data, p_scan_evt->params.p_not_found->data.p_data,
                        p_scan_evt->params.p_not_found->data.len);
                scan.data_len = p_scan_evt->params.p_not_found->data.len;
                nrf_queue_push (&m_scan_queue, &scan);
                m_channel->on_evt (RI_COMM_RECEIVED,
                                   &scan,
                                   sizeof (ri_adv_scan_t));
            }

            break;

        default:
            LOGW ("Unknown event\r\n");
    }
}

NRF_SDH_BLE_OBSERVER (m_scan_observer, APP_BLE_OBSERVER_PRIO, nrf_ble_scan_on_ble_evt,
                      NULL);

rd_status_t ri_adv_tx_interval_set (const uint32_t ms)
{
    rd_status_t err_code = RD_SUCCESS;

    if (MIN_ADV_INTERVAL_MS > ms || MAX_ADV_INTERVAL_MS < ms)
    {
        err_code |= RD_ERROR_INVALID_PARAM;
    }
    else
    {
        m_advertisement_interval_ms = ms;
    }

    return err_code;
}

rd_status_t ri_adv_tx_interval_get (uint32_t * ms)
{
    rd_status_t err_code = RD_SUCCESS;

    if (NULL == ms)
    {
        err_code |= RD_ERROR_NULL;
    }
    else
    {
        *ms = m_advertisement_interval_ms;
    }

    return err_code;
}

rd_status_t ri_adv_manufacturer_id_set (const uint16_t id)
{
    m_manufacturer_id = id;
    return RD_SUCCESS;
}

rd_status_t ri_adv_channels_set (const ri_radio_channels_t channels)
{
    m_radio_channels = channels;
    return RD_SUCCESS;
}

static rd_status_t format_adv (const ri_comm_message_t * const p_message,
                               advertisement_t * const p_adv)
{
    rd_status_t err_code = RD_SUCCESS;

    if ( (NULL == p_message) || (NULL == p_adv))
    {
        err_code |= RD_ERROR_NULL;
    }
    else
    {
        // Build specification for data into ble_advdata_t advdata
        ble_advdata_t advdata = {0};
        // Only valid flag
        uint8_t       flags = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED
                              | BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE;
        // Build manufacturer specific data
        ble_advdata_manuf_data_t manuf_specific_data = {0};
        // Build UUID data
        ble_uuid_t m_adv_uuids[] =
        {
            {m_service_uuid, BLE_UUID_TYPE_BLE}
        };
        // Preserve const of data passed to us.
        uint8_t manufacturer_data[RI_COMM_MESSAGE_MAX_LENGTH];
        memcpy (manufacturer_data, p_message->data, p_message->data_length);
        manuf_specific_data.data.p_data = manufacturer_data;
        manuf_specific_data.data.size   = p_message->data_length;
        manuf_specific_data.company_identifier = m_manufacturer_id;
        // Point to manufacturer data and flags set earlier
        advdata.flags                 = flags;
        advdata.p_manuf_specific_data = &manuf_specific_data;

        if (m_include_service_uuid)
        {
            advdata.uuids_more_available.p_uuids = m_adv_uuids;
            advdata.uuids_more_available.uuid_cnt = 1;
        }

        // If manufacturer data is not set, assign "UNKNOWN"
        if (0 == m_manufacturer_id)
        {
            manuf_specific_data.company_identifier = 0xFFFF;
        }

        // Encode data
        err_code |= ruuvi_nrf5_sdk15_to_ruuvi_error (
                        ble_advdata_encode (&advdata, p_adv->data.adv_data.p_data,
                                            & (p_adv->data.adv_data.len)));
    }

    return err_code;
}

static rd_status_t format_scan_rsp (advertisement_t * const p_adv)
{
    rd_status_t err_code = RD_SUCCESS;
    ble_advdata_t scanrsp = {0};

    if (NULL == p_adv)
    {
        err_code |= RD_ERROR_NULL;
    }
    // Add scan response
    else
    {
        // Name will be read from the GAP data
        scanrsp.name_type = BLE_ADVDATA_FULL_NAME;
        uint8_t len = strlen (m_name);
        err_code |= sd_ble_gap_device_name_set (&m_security, (uint8_t *) m_name, len);

