ruuvi/ruuvi.drivers.c/src/nrf5_sdk15_platform/communication/ruuvi_nrf5_sdk15_communication_ble_advertising.c
        if (m_advertise_nus)
        {
#           if RUUVI_NRF5_SDK15_GATT_ENABLED
            scanrsp.uuids_complete.uuid_cnt = 1;
            scanrsp.uuids_complete.p_uuids = & (m_adv_uuids[0]);
#           else
            err_code |= RD_ERROR_NOT_SUPPORTED;
#           endif
        }

        // Encode data
        err_code |= ble_advdata_encode (&scanrsp, p_adv->data.scan_rsp_data.p_data,
                                        & (p_adv->data.scan_rsp_data.len));
    }

    return ruuvi_nrf5_sdk15_to_ruuvi_error (err_code);
}

static rd_status_t format_msg (const ri_comm_message_t * const p_message,
                               advertisement_t * const p_adv)
{
    rd_status_t err_code = RD_SUCCESS;

    if ( (NULL == p_message) || (NULL == p_adv))
    {
        err_code |= RD_ERROR_NULL;
    }
    else if ( (p_message->data_length) > RI_COMM_MESSAGE_MAX_LENGTH)
    {
        err_code |= RD_ERROR_DATA_SIZE;
    }
    else
    {
        err_code |= format_adv (p_message, p_adv);

        if (m_scannable)
        {
            err_code |= format_scan_rsp (p_adv);
        }
    }

    return err_code;
}

/** @brief Determine appropriate PHY and message type.
 *
 */
static rd_status_t set_phy_type (const ri_comm_message_t * const p_message,
                                 advertisement_t * const p_adv)
{
    rd_status_t err_code = RD_SUCCESS;
    ri_radio_modulation_t modulation;
    bool extended_required = false;
    bool sec_phy_required = false;

    if ( (NULL == p_message) || (NULL == p_adv))
    {
        err_code |= RD_ERROR_NULL;
    }
    else
    {
        err_code |= ri_radio_get_modulation (&modulation);

        if (p_message->data_length > NONEXTENDED_ADV_MAX_LEN)
        {
            sec_phy_required = true;
            extended_required = true;
        }

        switch (modulation)
        {
            case RI_RADIO_BLE_125KBPS:
                p_adv->params.primary_phy = BLE_GAP_PHY_CODED;

                if (sec_phy_required)
                {
                    p_adv->params.secondary_phy = BLE_GAP_PHY_CODED;
                }

                extended_required = true;
                break;

            case RI_RADIO_BLE_1MBPS:
                p_adv->params.primary_phy = BLE_GAP_PHY_1MBPS;

                if (sec_phy_required)
                {
                    p_adv->params.secondary_phy = BLE_GAP_PHY_1MBPS;
                }

                break;

            case RI_RADIO_BLE_2MBPS:
                p_adv->params.primary_phy = BLE_GAP_PHY_1MBPS;

                if (sec_phy_required)
                {
                    p_adv->params.secondary_phy = BLE_GAP_PHY_2MBPS;
                    extended_required = true;
                }

                break;
        }

        switch (m_type)
        {
            case NONCONNECTABLE_NONSCANNABLE:
                if (extended_required)
                {
                    p_adv->params.properties.type =
                        BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
                }
                else
                {
                    p_adv->params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
                }

                break;

            case NONCONNECTABLE_SCANNABLE:
                if (extended_required)
                {
                    p_adv->params.properties.type =
                        BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_SCANNABLE_UNDIRECTED;
                }
                else
                {
                    p_adv->params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED;
                }

                break;

            case CONNECTABLE_SCANNABLE:
                if (extended_required
                        && sec_phy_required
                        && p_message->data_length > NONEXTENDED_ADV_MAX_LEN)
                {
                    // Cannot put extended payload and scan response into secondary PHY at the same time.
                    err_code |= RD_ERROR_DATA_SIZE;
                    LOGE ("Error: Too long data for a scannable packet.\r\n");
                }
                else
                {
                    p_adv->params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
                }

                break;

            case CONNECTABLE_NONSCANNABLE:
                if (extended_required)
                {
                    p_adv->params.properties.type =
                        BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;
                }
                else
                {
                    // Cannot have non-scannable connectable event on primary PHY, fallback on extended advertisement.
                    LOGW ("Warning: Fallback to BLE 5.0 done.\r\n");
                    p_adv->params.properties.type =
                        BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;
                }

                break;

            default:
                LOGW ("Unknown advertisement type\r\n");
                break;
        }
    }

    return err_code;
}

/**
 *  @brief Asynchronous transfer function. Puts/gets message in driver queue
 *
 *  @param[in, out] msg A message to put/get to/from driver queue
 *  @return RD_MORE_AVAILABLE if data was read from queue and there is more data available.
 *  @return RD_SUCCESS if queue operation was successful.
 *  @return RD_ERROR_NULL if message is NULL.
 *  @return RD_ERROR_DATA_SIZE if message length is larger than queue supports.
 *  @return RD_ERROR_NO_MEM if queue is full and new data cannot be queued.
 *  @return RD_ERROR_NOT_FOUND if queue is empty and no more data can be read.
 */
static rd_status_t ri_adv_send (ri_comm_message_t * message)
{
    rd_status_t err_code = RD_SUCCESS;
    ret_code_t nrf_code = NRF_SUCCESS;

    if (NULL == message)
    {
        err_code |= RD_ERROR_NULL;
    }
    else
    {
        // Create message
        advertisement_t adv = {0};
        adv.data.adv_data.p_data = adv.adv_data;
        adv.data.adv_data.len = sizeof (adv.adv_data);

        if (m_scannable)
        {
            adv.data.scan_rsp_data.p_data = adv.scan_data;
            adv.data.scan_rsp_data.len = sizeof (adv.scan_data);
        }
        else
        {
            adv.data.scan_rsp_data.p_data = NULL;
            adv.data.scan_rsp_data.len = 0;
        }

        err_code |= format_msg (message, &adv);
        err_code |= set_phy_type (message, &adv);
        adv.params.max_adv_evts = message->repeat_count;
        adv.params.duration = 0; // Do not timeout, use repeat_count.
        adv.params.filter_policy = BLE_GAP_ADV_FP_ANY;
        adv.params.interval = MSEC_TO_UNITS (m_advertisement_interval_ms, UNIT_0_625_MS);
        ruuvi_nrf5_sdk15_radio_channels_set (adv.params.channel_mask, m_radio_channels);
        adv.tx_pwr = m_tx_power;
        nrf_code |= nrf_queue_push (&m_adv_queue, &adv);
        err_code |= prepare_tx();
    }

    return err_code | ruuvi_nrf5_sdk15_to_ruuvi_error (nrf_code);
}

