ruuvi/ruuvi.drivers.c/src/nrf5_sdk15_platform/communication/ruuvi_nrf5_sdk15_communication_ble_advertising.c
static rd_status_t ri_adv_receive (ri_comm_message_t * message)
{
    return RD_ERROR_NOT_IMPLEMENTED;
}

rd_status_t ri_adv_init (ri_comm_channel_t * const channel)
{
    rd_status_t err_code = RD_SUCCESS;

    if (NULL == channel)
    {
        err_code |= RD_ERROR_NULL;
    }
    else if (!ri_radio_is_init() || m_advertisement_is_init)
    {
        err_code |= RD_ERROR_INVALID_STATE;
    }
    else
    {
        m_advertisement_is_init = true;
        m_channel = channel;
        m_channel->init    = ri_adv_init;
        m_channel->uninit  = ri_adv_uninit;
        m_channel->send    = ri_adv_send;
        m_channel->read    = ri_adv_receive;
        m_scannable = false;
        // Enable channels by default.
        m_radio_channels.channel_37 = true;
        m_radio_channels.channel_38 = true;
        m_radio_channels.channel_39 = true;
    }

    return err_code;
}

rd_status_t ri_adv_uninit (ri_comm_channel_t * const channel)
{
    rd_status_t err_code = RD_SUCCESS;

    // Stop advertising
    if (true == m_advertising)
    {
        sd_ble_gap_adv_stop (m_adv_handle);
        m_advertising = false;
    }

    m_advertisement_is_init = false;
    // Clear function pointers, including on event
    memset (channel, 0, sizeof (ri_comm_channel_t));
    m_scannable = false;
    m_tx_power = 0;
    // Flush TX buffer.
    nrf_queue_reset (&m_adv_queue);
    return err_code;
}

rd_status_t ri_adv_set_ext_adv_enabled (const bool is_ext_adv_enabled)
{
    m_is_ext_adv_enabled = is_ext_adv_enabled;
    return RD_SUCCESS;
}

rd_status_t ri_adv_scan_start (const uint32_t window_interval_ms,
                               const uint32_t window_size_ms)
{
    ret_code_t status = NRF_SUCCESS;
    rd_status_t err_code = RD_SUCCESS;
    nrf_ble_scan_init_t scan_init_params = {0};
    ble_gap_scan_params_t scan_params = {0};
    uint8_t scan_phys = ruuvi_nrf5_sdk15_radio_phy_get();
    scan_params.active = 0; // Do not scan for scan responses
    ruuvi_nrf5_sdk15_radio_channels_set (scan_params.channel_mask, m_radio_channels);
    scan_params.extended = m_is_ext_adv_enabled;
#if defined(RUUVI_NRF5_SDK15_ADV_EXTENDED_ENABLED) && RUUVI_NRF5_SDK15_ADV_EXTENDED_ENABLED
    {
        // 2MBit/s not allowed on primary channel,
        // extended advertisement on secondary channel is automatically
        // scanned with all supported PHYs.
        if (BLE_GAP_PHY_2MBPS == scan_phys)
        {
            scan_phys = BLE_GAP_PHY_1MBPS;
        }
    }
#endif
    NRF_LOG_INFO ("ri_adv_scan_start: NRF modulation: 0x%02x, ext_adv=%d",
                  scan_phys, scan_params.extended);

    if (RD_SUCCESS == err_code)
    {
        scan_params.interval = MSEC_TO_UNITS (window_interval_ms, UNIT_0_625_MS);
        scan_params.report_incomplete_evts = 0;
        scan_params.scan_phys = scan_phys;
        scan_params.window =  MSEC_TO_UNITS (window_size_ms, UNIT_0_625_MS);
        scan_params.timeout = ri_radio_num_channels_get (m_radio_channels) *
                              MSEC_TO_UNITS (window_interval_ms, UNIT_10_MS);
        scan_init_params.p_scan_param = &scan_params;
        status |= nrf_ble_scan_init (&m_scan,           // Scan control structure
                                     &scan_init_params, // Default params for NULL values.
                                     on_advertisement); // Callback on data
        status |= nrf_ble_scan_start (&m_scan);
    }

    return ruuvi_nrf5_sdk15_to_ruuvi_error (status) | err_code;
}

rd_status_t ri_adv_scan_stop (void)
{
    nrf_ble_scan_stop();
    return RD_SUCCESS;
}

rd_status_t ri_adv_tx_power_set (int8_t * dbm)
{
    ret_code_t err_code = NRF_SUCCESS;

    if (NULL == dbm)
    {
        err_code |= NRF_ERROR_NULL;
    }
    else if (!m_advertisement_is_init)
    {
        err_code |= NRF_ERROR_INVALID_STATE;
    }
    else
    {
        if (*dbm <= -40)      { m_tx_power = -40; }
        else if (*dbm <= -20) { m_tx_power = -20; }
        else if (*dbm <= -16) { m_tx_power = -16; }
        else if (*dbm <= -12) { m_tx_power = -12; }
        else if (*dbm <= -8)  { m_tx_power = -8; }
        else if (*dbm <= -4)  { m_tx_power = -4; }
        else if (*dbm <= 0)   { m_tx_power = 0; }
        else if (*dbm <= 4)   { m_tx_power = 4; }

#ifdef NRF52840_XXAA
        else if (*dbm <= 8)   { m_tx_power = 8; }

#endif
        else
        {
            err_code |= NRF_ERROR_INVALID_PARAM;
        }

        if (RD_SUCCESS == err_code)
        {
            *dbm = m_tx_power;
        }
    }

    return ruuvi_nrf5_sdk15_to_ruuvi_error (err_code);
}

rd_status_t ri_adv_tx_power_get (int8_t * dbm)
{
    *dbm = m_tx_power;
    return RD_SUCCESS;
}

rd_status_t ri_adv_scan_response_setup (const char * const name,
                                        const bool advertise_nus)
{
    ret_code_t err_code = NRF_SUCCESS;

    if (NULL != name)
    {
        strcpy (m_name, name);
    }

    m_scannable = true;
    m_advertise_nus = advertise_nus;
    return ruuvi_nrf5_sdk15_to_ruuvi_error (err_code);
}

rd_status_t ri_adv_type_set (ri_adv_type_t type)
{
    rd_status_t err_code = RD_SUCCESS;
    m_type = type;

    if ( (type == NONCONNECTABLE_NONSCANNABLE)
            || (type == CONNECTABLE_NONSCANNABLE))
    {
        m_scannable = false;
    }
    else
    {
        m_scannable = true;
    }

    return err_code;
}

rd_status_t ri_adv_stop()
{
    // SD returns error if advertisement wasn't ongoing, ignore error.
    (void) ruuvi_nrf5_sdk15_to_ruuvi_error (sd_ble_gap_adv_stop (
            m_adv_handle));
    m_advertising = false;
    nrf_queue_reset (&m_adv_queue);
    return RD_SUCCESS;
}

uint16_t ri_adv_parse_manuid (uint8_t * const data,
                              const size_t data_length)
{
    uint8_t * manuf_id;
    manuf_id = ble_advdata_parse (data, data_length,
                                  BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA);

    if (manuf_id == NULL)
    {
        return 0;
    }
    else
    {
        return (manuf_id[1] << 8 | manuf_id[0]);
    }
}

void ri_adv_enable_uuid (const bool enable_uuid)
{
    m_include_service_uuid = enable_uuid;
}

void ri_adv_set_service_uuid (const uint16_t uuid)
{
    m_service_uuid = uuid;
}

#endif